[
  {
    "Id": "83fe8f03-40af-4dbe-b61b-5c6e7782cf79",
    "Name": "Yamada Jirokichi",
    "ImageUrl": "https://mensagens.culturamix.com/blog/wp-content/uploads/2019/05/Yamada-Jirokichi.jpg",
    "ShortStory": "Jirokichi Yamada (Yamada Jirokichi, January 9, 1863 – October 23, 1930) was the 15th and last official headmaster or sōke of Kashima Shinden Jikishinkage-ryū, a (koryū) of the Japanese martial art of swordsmanship (kenjutsu). He was a student of the 14th sōke, Sakakibara Kenkichi.In the early twentieth century (1927) he published a book documenting all five classical kata of this koryū that originates from the sixteenth century. Probably the foremost student of Sakakibara Kenkichi, headmaster of the Jikishinkage ryu (who never named a formal successor), he was also famous for pushing his students to extremes. Among his students was Omori Sogen (1904-1994), who later became an influential Zen teacher. Sogen not only studied the sword, but also calligraphy in what may be considered Tesshu’s tradition – he was, in fact, something of a Tesshu enthusiast, lived in Tesshu's old house and was founder of the Tesshukai (Tesshu association). He has also left an account of a training experience that appears quite similar the training instituted by Tesshu.",
    "Quotes": [
      {
        "Id": 1,
        "Text": "The way of the sword and the Way of Zen are identical, for they have the same purpose; that of killing the ego.",
        "SamuraiId": "83fe8f03-40af-4dbe-b61b-5c6e7782cf79"
      },
      {
        "Id": 2,
        "Text": "Sword and mind must be united. Technique by itself is insufficient, and spirit alone is not enough.,",
        "SamuraiId": "83fe8f03-40af-4dbe-b61b-5c6e7782cf79"
      }
    ]
  },
  {
    "Id": "465bc6ce-3c13-47cf-82f0-32008454f6ba",
    "Name": "Yamamoto Tsunetomo",
    "ImageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/da/Yamamoto_Tsunetomo.jpg/250px-Yamamoto_Tsunetomo.jpg",
    "ShortStory": "Tsunetomo or Jocho , the name he took after retiring and becoming a monk, had entered into the service of Lord Mitsushige at the age of nine. For thirty years he devoted his life to the service of his lord and clan. When Nabeshima died in 1700, Yamamoto did not choose to follow his master in death in ‘junshi’ (=”suicide through fidelity”) because the master had expressed a dislike of the practice in his life. His loyalty to his Lord was unquestionable. Instead, Yamamoto followed his lord’s wishes and refrained from junshi. After some disagreements with Nabeshima’s successor, Yamamoto renounced the world and retired to a hermitage in the mountains, to live “in the shadow of the leaves.” At the age of forty-one he received Ketsu-myaku (blood relationship) from the priest Tannen. Later in life (between 1709 and 1716), he narrated many of his thoughts to a fellow samurai, Tsuramoto Tashiro. Many of these aphorisms concerned his lord’s father and grandfather Naoshige and the failing ways of the samurai caste. These commentaries were compiled and published in 1716 under the title of Hagakure. The work itself placed great importance on a samurai’s commitment to death. Tsunetomo believed that becoming one with death in one’s thoughts, even in life, was the highest attainment of purity and focus. The sentence, “Bushido is a way of dying,” is often said to summarize the work’s central theme.",
    "Quotes": [
      {
        "Id": 3,
        "Text": "There is surely nothing other than the single purpose of the present moment. A man's whole life is a succession of moment after moment. There will be nothing else to do, and nothing else to pursue. Live being true to the single purpose of the moment.",
        "SamuraiId": "465bc6ce-3c13-47cf-82f0-32008454f6ba"
      },
      {
        "Id": 4,
        "Text": "To give a person an opinion one must first judge well whether that person is of the disposition to receive it or not.",
        "SamuraiId": "465bc6ce-3c13-47cf-82f0-32008454f6ba"
      },
      {
        "Id": 5,
        "Text": "Be true to the thought of the moment and avoid distraction. Other than continuing to exert yourself, enter into nothing else, but go to the extent of living single thought by single thought.",
        "SamuraiId": "465bc6ce-3c13-47cf-82f0-32008454f6ba"
      }
    ]
  },
  {
    "Id": "507eb708-16b8-48b9-8e3e-8cc8cfe5a37d",
    "Name": "Morihei Ueshiba",
    "ImageUrl": "https://th.bing.com/th/id/OIP.FMQKPW4cPrbt8H9Jh3eXJQHaJc?pid=ImgDet&rs=1",
    "ShortStory": "Murihei Ueshiba (December 14, 1883 – April 26, 1969) was a martial artist and founder of the Japanese martial art of Aikido. He is often referred to as 'the founder' Kaiso or Ōsensei, 'Great Teacher. The son of a landowner from Tanabe, Ueshiba studied a number of martial arts in his youth, and served in the Japanese Army during the Russo-Japanese War. After being discharged in 1907, he moved to Hokkaidō as the head of a pioneer settlement; here he met and studied with Takeda Sokaku, the founder of Daitō-ryū aiki-jūjutsu. On leaving Hokkaido in 1919, Ueshiba joined the Ōmoto-kyō movement, a Shinto sect, in Ayabe, where he served as a martial arts instructor and opened his first dojo. He accompanied the head of the Ōmoto-kyō group, Onisaburo Deguchi, on an expedition to Mongolia in 1924, where they were captured by Chinese troops and returned to Japan. The following year, he experienced a spiritual enlightenment, stating that, “a golden spirit sprang up from the ground, veiled my body, and changed my body into a golden one. After this experience, his martial arts skill appeared to be greatly increased. Ueshiba moved to Tokyo in 1926, where he set up the Aikikai Hombu Dojo. In the aftermath of World War II the dojo was closed, but Ueshiba continued training at another dojo he had set up in Iwama. From the end of the war until the 1960s, he worked to promote aikido throughout Japan and abroad. He died from liver cancer in 1969.",
    "Quotes": [
      {
        "Id": 6,
        "Text": "The real Way of a Warrior is to prevent such slaughter — it is the Art of Peace, the power of love.",
        "SamuraiId": "507eb708-16b8-48b9-8e3e-8cc8cfe5a37d"
      },
      {
        "Id": 7,
        "Text": "There are no contests in the Art of Peace. A true warrior is invincible because he or she contests with nothing.",
        "SamuraiId": "507eb708-16b8-48b9-8e3e-8cc8cfe5a37d"
      },
      {
        "Id": 9,
        "Text": "A warrior is always engaged in a life-and-death struggle for Peace.",
        "SamuraiId": "507eb708-16b8-48b9-8e3e-8cc8cfe5a37d"
      },
      {
        "Id": 10,
        "Text": "The Way of a Warrior is to establish harmony.",
        "SamuraiId": "507eb708-16b8-48b9-8e3e-8cc8cfe5a37d"
      }
    ]
  },
  {
    "Id": "6fef990f-5dbd-4663-959e-374cf77f7294",
    "Name": "Ishida Mitsunari",
    "ImageUrl": "https://samuraiswords.store/wp-content/uploads/2018/12/806px-Ishida_Mitsunari.jpg",
    "ShortStory": "He was born in Ishida Village at Omi Province which is present-day Nagahama City in Shiga Prefecture. As a child, he was given the name Sakichi. If legend can be trusted, he was serving as a Buddhist temple monk before being recruited to serve under Toyotomi Hideyoshi in 1578. The legend that he was a Buddhist monk became popular only during the Edo period. He was only 13 years old when Toyotomi Hideyoshi ran across him while busy on his military training exercises. He won the favor of Toyotomi Hideyoshi due to him being an excellent financial manager, and he was also considered as a good master of the tea ceremony. Historians reveal that veterans of the war were not satisfied with Mitsunari’s leadership skills on the battlefield. He was even viewed as a villain and should not be characterized as having positive traits, deeming him worthy of Hideyoshi’s approval. Before becoming an advisor to Toyotomi Hideyoshi, Mitsunari met him while he was young and Hideyoshi was still a Daimyo of Nagahama. It was business acuity in securing additional lands for Toyotomi Hideyoshi that made him an asset to his military lord. He assisted Toyotomi in attacking castles like Takamatsu and Tottori. However, his skills shined most at making calculations; this led him to become one of the most talented and skilled financial managers of Hideyoshi. He was considered to be a weakling as a bureaucrat. However, this image of failure did not last long since historians took of Mitsunari’s other talents such as being a great planner and gaining victory on the battlefield. Mitsunari’s role was important to Japan’s future when his liege died. He was faithful to the Toyotomi clan, and as a faithful follower, he swore to protect Hideyori who was Hideyoshi’s son. This earned him the ire of Tokugawa Ieyasu who was then a major contender of the Shogunate. A floating theory is that he was given a pardon by Ieyasu and in his mercy, hid him. Yet for political reasons, he was removed from his lands and came to live with one of Ieyasu’s veteran generals named Sakakibara Yasumasa. He stayed with the general until Ishida Mitsunari died of old age. The cause of death, according to this theory, was not as traumatic as the one previously mentioned.",
    "Quotes": [
      {
        "Id": 11,
        "Text": "Honour may not win power, but it wins respect. And respect earns power.",
        "SamuraiId": "6fef990f-5dbd-4663-959e-374cf77f7294"
      },
      {
        "Id": 12,
        "Text": "I should stop expecting so much.",
        "SamuraiId": "6fef990f-5dbd-4663-959e-374cf77f7294"
      },
      {
        "Id": 13,
        "Text": "Honour always wins, it is inevitable.",
        "SamuraiId": "6fef990f-5dbd-4663-959e-374cf77f7294"
      }
    ]
  },
  {
    "Id": "8c9a1108-bb85-48c8-825b-11d27bd6e058",
    "Name": "Miyamoto Musashi",
    "ImageUrl": "https://i.pinimg.com/564x/b8/02/a8/b802a89e4bfe68758582c02a56774840.jpg",
    "ShortStory": "Miyamoto Masana, artistic name Niten, (born 1584, Mimasaka or Harima, Japan—died June 13, 1645, Higo), famous Japanese soldier-artist of the early Edo (Tokugawa) period (1603–1867). Musashi began his career as a fighter early in life when, at age 13, he killed a man in single combat. In 1600 he was on the losing side of the Battle of Sekigahara (which paved the way for establishing the Tokugawa shogunate), becoming one of the rōnin (masterless samurai). In time he set out on a personal quest to develop perfect sword technique. He invented the nitō ichi-ryū, the style of fencing with two swords, and is often referred to today as kensai (‘‘sword saint’’). Musashi claimed to have fought in more than 60 individual sword fights, many of which were to the death and all of which he won. Musashi’s most famous encounter took place in 1612, against his arch rival Sasaki Kojirō, a swordsman whose skill was reported to be equal to his own. The contest took place on a small island off the coast of Japan. While being rowed out to the dueling site, Musashi fashioned a wooden sword out of an oar. When the two enemies finally met on the beach, Musashi quickly dispatched Kojirō with a well-placed blow to the head using his wooden sword. After that, feeling that he had reached his peak as a swordsman, Musashi retired from the dueling life, though he trained some students and helped to suppress the Shimabara Rebellion in 1637. According to legend, Musashi wrote his famous work on strategy—Gorin no sho (The Book of Five Rings), which dealt with the martial experience both individually and militarily—on his deathbed. Following its first English translation in 1974, the book was seriously studied by executives in the West in order to better understand Japanese management techniques and strategies.",
    "Quotes": [
      {
        "Id": 14,
        "Text": "You can only fight the way you practice.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 15,
        "Text": "If there isn’t discipline, how can there be a true realization of an ideal?",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 16,
        "Text": "One thousand days of lessons for discipline; ten thousand days of lessons for mastery.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 17,
        "Text": "The path that leads to truth is littered with the bodies of the ignorant.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 18,
        "Text": "To win any battle, you must fight as if you are already dead.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 19,
        "Text": "No fear, no hesitation, no surprise, no doubt.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      },
      {
        "Id": 20,
        "Text": "Get beyond love and grief: exist for the good of man.",
        "SamuraiId": "8c9a1108-bb85-48c8-825b-11d27bd6e058"
      }
    ]
  },
  {
    "Id": "d1058440-1fb7-414c-811b-ebde7efa8c17",
    "Name": "Tsukahara Bokuden",
    "ImageUrl": "https://www.historyoffighting.com/resources/Bokuden%20Normal.jpg?timestamp=1359727554421",
    "ShortStory": "Tsukahara Bokuden was born to the Yoshikawa family in Hitachi province. His father was a priest for the shrine of Takemikazuchi and his family served the Kashima clan. His childhood name was Asako when Tsukahara Yasumoto lost his own son, he adopted Bokuden at the age of fourteen. His original family and his adopted family could trace their ancestry back to the imperial family and had close ties to the imperial house. Both his birth father and adoptive father taught him the local sword fighting style of Tenshin Shōden Katori Shintō-Ryū, which Bokuden mastered by the age of seventeen. Wishing to improve his skills further, Bokuden decided to take up the swordsmen's journey of musha shugyo, a type of traveling/training noblemen engaged in, sometimes compared to the western idea of knight-errant. Like those western counterparts, these wonderings of Tsukahara Bokuden produced stories that are hard to discern as to which contains the truth and which ones have been exaggerated. The most reliable source of information comes from the grandchild of one of Bokuden's students, Kato Nobutoshi. In this record, it claims that Bokuden engaged in at least nineteen separate duels and fought in up to 37 separate battles, where he claimed 21 heads of important warriors. This same record claims Tsukahara never suffered any sword wound in both duel or battle, but did suffer a few arrow wounds in his many skirmishes. His fame for such impressive fighting skills were only augmented by the numerous famous samurai he was reported to have trained. This impressive list includes Chōsokabe Nobuchika, Ashikaga Yoshiteru, Hosokawa Fujitaka, Kitabatake Tomonori, Yamamoto Kansuke, and Arakida Yoshishige. During one of his trips home, Bokuden's adoptive father decided solidify his place as heir by arranging his daughter to marry Bokuden, solidifying his place as future clan leader. Bokuden thus had a permanent place he could return between his battles, wanderings, and time spent in meditation. Bokuden is believed to have spent some of his time training with Kamiizumi Nobutsuna, even fighting another duel to help Nobutsuna establish his own martial arts school. As Bokuden continued to wander and train, he delevoped his own fighting style, which he called Kashima Shintō-Ryū. The exact nature of this style is lost to histroy. Tsukahara claimed Takemikazuchi (the deity his birth father served as a priest) gave the techique to him directly during a one thousand day stent meditating at the Kashima shrine. Although its unknown the exact nature of his style, it is thought to have incorporated a strategy of standing exposed, chest undefended from attack. When the foe was drawn in by this supposed opening, Bokuden would strike first, missing his foe's attack my mere inches. With this unique fighting style, Bokuden settled down and served his lord, establishing a school to train his pupils. In respect to his talent, Kashima Yoshimi, Tsukahara Bokuden's lord, allowed him to work full time at his school. Bokuden died at the age of 83 in 1571, passing on his school to his oldest son.",
    "Quotes": [
      {
        "Id": 21,
        "Text": "Mental bearing (calmness), not skill, is the sign of a matured samurai. A Samurai, therefore, should neither be pompous nor arrogant.",
        "SamuraiId": "d1058440-1fb7-414c-811b-ebde7efa8c17"
      },
      {
        "Id": 22,
        "Text": "My art is different than yours; it consists not in defeating others, but in not being defeated.",
        "SamuraiId": "d1058440-1fb7-414c-811b-ebde7efa8c17"
      }
    ]
  },
  {
    "Id": "b2568c04-d173-4bd4-9d5b-724255c0cedf",
    "Name": "Taisen Deshimaru",
    "ImageUrl": "https://alchetron.com/cdn/taisen-deshimaru-c30ba7ad-a30f-4e18-aa00-3d76e7f827c-resize-750.jpeg",
    "ShortStory": "The Reverend Taisen Deshimaru (Yasuo was his given first name) was born in 1914 near the town of Saga, on the isle of Kyushu. His father ran the local fisherman’s trade union. His mother was a fervent practitioner of Jôdô Shinshu Buddhism (the Pure Land School), founded by Shinran; she passed on her faith in the teachings of this school to him. He was also influenced by the spirit of bushido that was prevalent in Japan at that time, especially in the town of Saga, an important spiritual place for the samurai. In 1935, while studying Economics in Tokyo, he began practicing Sôtô Zen with Kodo Sawaki Roshi, one of the great Zen masters of the twentieth century, who was godo (instructor of monks in the dojo) of Sojiji temple, one of the two main temples of the Soto School. He wanted to become a monk but Sawaki Roshi encouraged him to remain a lay practitioner, which he did for the next thirty years. During the war, discharged because of his myopia, he spent several years in Indonesia where he would later return. In 1965, just before his death, Kodo Sawaki ordained him a monk. Taisen Deshimaru felt he had thus resolved the contradictions he had experienced between the material and spiritual aspects of life and between the teachings of Shinshu and Zen. In 1967, he was invited by a group of French macrobiotics to France. There, he committed himself totally to the teaching of zazen and of the Zen tradition. It was the right moment and his mission quickly made a big impression. Within a few years, he had done numerous talks and practice sessions, translated basic Zen texts, published written works, and created the European Zen Association (which would become “International”); the number of disciples increased and he founded many places of practice. He received Dharma transmission from Yamada Reirin Roshi in 1970, and was nominated Kaikyosokan (head of missionary activity) for Europe in 1976. From then on, the scale of his missionary work got larger and larger, and lead to the creation of the Gendronnière temple in 1979. At the same time, the increasing number of disciples, introducing and adapting the tradition, managing the whole association, required more and more work. He wanted to bring over other Japanese teachers to assist him, but he fell ill in 1981. Taisen Deshimaru Roshi died of cancer on 30th April 1982 in Tokyo. Blessed with extraordinary energy, Taisen Deshimaru Roshi was animated by an unwavering faith in zazen practice, in the pure teachings of the buddhas and patriarchs, and in the importance of this practice and teaching for the coming civilisation. Although he did not nominate a successor or give the official transmission (shiho), he transmitted this faith to many of the disciples he had trained, some of whom he designated as future masters.",
    "Quotes": [
      {
        "Id": 23,
        "Text": "Nobody today is normal, everybody is a little bit crazy or unbalanced, people's minds are running all the time. Their perceptions of the world are partial, incomplete. They are eaten alive by their egos. They think they see, but they are mistaken; all they do is project their madness, their world, upon the world. There is no clarity, no wisdom in that!",
        "SamuraiId": "b2568c04-d173-4bd4-9d5b-724255c0cedf"
      },
      {
        "Id": 24,
        "Text": "Human beings are afraid of dying. They are always running after something: money, honor, and pleasure. But if you had to die now, what would you want?",
        "SamuraiId": "b2568c04-d173-4bd4-9d5b-724255c0cedf"
      },
      {
        "Id": 25,
        "Text": "The body moves naturally, automatically, without any personal intervention or awareness. If we think too much, our actions become slow and hesitant.",
        "SamuraiId": "b2568c04-d173-4bd4-9d5b-724255c0cedf"
      }
    ]
  },
  {
    "Id": "4e6db0ba-bf16-4ef8-aab6-0de059b315da",
    "Name": "Uesugi Kenshin",
    "ImageUrl": "https://vignette.wikia.nocookie.net/nobunagaambitioniron/images/1/1f/Kenshin_Uesugi_3.jpg/revision/latest/scale-to-width-down/340?cb=20100916190907",
    "ShortStory": "Uesugi Kenshin, also called Uesugi Terutora, original name Nagao Torachiyo, (born Feb. 18, 1530, Takada, Echigo province, Japan—died April 19, 1578, Takada), one of the most powerful military figures in 16th-century Japan. Nagao Torachiyo was the third son of the head of Echigo province in northeastern Japan. With the death of his father in 1543, the family’s control of the area began to disintegrate. Torachiyo not only restored order to the area but also gained control of neighbouring provinces, becoming one of the most powerful warriors on the Kantō Plain in central Honshu. In 1552 Uesugi Norimasa, who had inherited the position of kanrei, or governor-general, of Kantō and whose family had long been the most powerful in the area, was defeated by the Hōjō clan and took shelter with Torachiyo, whom he adopted as his son. Torachiyo then changed his surname to Uesugi. He received many of the hereditary vassals of the Uesugi family, and he also became involved in a series of battles with the eastern warlords of the Hōjō and Takeda families for control of the Kantō region. Uesugi’s battles with the noted general Takeda Shingen resulted in no permanent gain for either side, however. Meanwhile, Oda Nobunaga had become the strongest military leader in Japan, and in 1573 he overthrew the shogunate and began to consolidate his control over the capital. The only warrior strong enough to challenge Oda was Uesugi, and in 1577 he agreed to undertake an expedition to restore the shogunate. He died, however, before the expedition could get under way.",
    "Quotes": [
      {
        "Id": 26,
        "Text": "Engage in combat fully determined to die and you will be alive; wish to survive in the battle and you will surely meet death.",
        "SamuraiId": "4e6db0ba-bf16-4ef8-aab6-0de059b315da"
      },
      {
        "Id": 27,
        "Text": "Those who cling to life die, and those who defy death live.",
        "SamuraiId": "4e6db0ba-bf16-4ef8-aab6-0de059b315da"
      },
      {
        "Id": 28,
        "Text": "Wars are to be won with swords and spears, not with rice and salt.",
        "SamuraiId": "4e6db0ba-bf16-4ef8-aab6-0de059b315da"
      },
      {
        "Id": 29,
        "Text": "Go to the battlefield firmly confident of victory and you will come home with no wounds whatsoever.",
        "SamuraiId": "4e6db0ba-bf16-4ef8-aab6-0de059b315da"
      },
      {
        "Id": 30,
        "Text": "Peace is achieved with rice and salt, not with katanas and arrows",
        "SamuraiId": "4e6db0ba-bf16-4ef8-aab6-0de059b315da"
      }
    ]
  },
  {
    "Id": "d17577ca-e490-450b-a800-ff6dd999cf63",
    "Name": "Yamaoka Tesshu",
    "ImageUrl": "http://www.shumpukan.co.uk/wp-content/uploads/2015/01/Yamaoka-Tesshu-1836-1888.jpg",
    "ShortStory": "Yamaoka Tesshu was born in Edo (modern day Tokyo) in 1836. At the time of his birth, he was known as Ono Tetsutaro. Later, he adopted the family name of Yamaoka from his spear instructor, who’s sister he married. Tesshu was born into a samurai family and began his study of swordsmanship when he was nine years old. Over time Tesshu studied a number of fencing styles and became highly proficient. When he was twenty-eight, Tesshu was defeated by a swordsman named Asari Gimei and became his student. Although larger and younger, Tesshu could not match his teacher’s mental state. During training sessions, Asari was known to force Tesshu all the way to the back of the dojo, then out into the street, knock him to the ground, and then slam the dojo door in his face. Confronted with this challenge, Tesshu increased his efforts in training and meditation continuously. Even when he was eating or sleeping, Tesshu was constantly thinking about fencing. He would sometimes wake up at night, jump out of bed, and get his wife to hold a sword so he could explore a new insight.  Then, one morning in 1880, when he was 45 years old, Tesshu attained enlightenment while sitting in zazen. Later that morning he went to the dojo to practice Kendo with Asari. Upon seeing Tesshu, Asari recognized at once that Tesshu had reached enlightenment. Asari, declined to fence with Tesshu, acknowledging Tesshu’s attainment by saying, “You have arrived.” Shortly after this, Tesshu went on to open his own school of fencing. Tesshu was 6ft tall, unusual for a Japanese person of his time, and very athletic. He was a natural leader and very competitive. So intense was his practice of his three main pursuits (fencing, Zen, and calligraphy), that his nickname was Demon Tesshu. Tesshu was also famous for combining his competitive nature with his love of drinking. Tesshu was a master calligrapher and is estimated to have created over 1,000,000 calligraphy paintings. His art works are considered important and are studied now, even as they were in his lifetime. Tesshu’s life bridged the time between feudal and modern Japan. Tesshu held a position as a bodyguard for the last Togugawa Shogun. Tesshu even played a role in the transition of power. Then Tesshu became a tutor for the Emperor Meiji during the emperor’s early adulthood. On one occasion the young emperor challenged Tesshu to a wrestling match. The emperor enjoyed sumo wrestling but he had acquired the inappropriate habit of challenging his aids to impromptu wrestling matches. On one occasion, following a bout of sake drinking, the emperor challenged Tesshu to wrestle. When Tesshu refused the challenge, whereupon the emperor tried to push and pull Tesshu, but the emperor found Tesshu to be immoveable. Then the emperor tried to strike Tesshu, but Tesshu moved slightly aside. The force of the emperor’s blow caused him to fall down, whereupon Tesshu pinned the emperor to the ground. The emperor’s other aids were furious with Tesshu and demanded that Tesshu apologize to the emperor. Tesshu asserted that he was in fact doing his duty and would commit suicide if the emperor requested, but he would not apologize. The emperor saw the wisdom of Tesshu’s way and gave up (temporarily) both wrestling and drinking. From then on Tesshu was one of the emperor’s most trusted advisors. On another occasion, the emperor, observing how worn Tesshu’s clothing was, gave Tesshu some money to buy new clothes. Tesshu, however, had little regard for material possessions and gave the money to the numerous poor people who sought the hospitality of his household. The next time Tesshu appeared before the emperor, he was wearing the same old clothes. What became of the new clothes? asked the emperor. Tesshu responded back, They went to you majesty’s children. Tesshu died from stomach cancer, in the year 1888, at the age of fifty-three. On the day before he died, Tesshu noticed that there were no sounds of training to be heard from his dojo. When Tessu was told that the students had canceled training to be with him in his last hours, he ordered them to return to the dojo saying, “Training is the only way to honor me! Tesshu’s last moments before his death were classical. First he composed his death poem, then he sat in zazen until he died.",
    "Quotes": [
      {
        "Id": 31,
        "Text": "As a samurai, I must strengthen my character; as a human being I must perfect my spirit",
        "SamuraiId": "d17577ca-e490-450b-a800-ff6dd999cf63"
      },
      {
        "Id": 32,
        "Text": "Thirst for victory leads to defeat; not tiring of defeat leads to victory.",
        "SamuraiId": "d17577ca-e490-450b-a800-ff6dd999cf63"
      },
      {
        "Id": 33,
        "Text": "If you want to obtain the secrets of such wonderful techniques, drill yourself, harden yourself, undergo severe training, abandoned body and mind; follow this course for years and you will naturally reach the profoundest levels. To know if water is hot or cold you must taste it yourself.",
        "SamuraiId": "d17577ca-e490-450b-a800-ff6dd999cf63"
      }
    ]
  },
  {
    "Id": "933e0300-7422-4696-a0c5-d0a458a527d0",
    "Name": "Tokugawa Ieyasu",
    "ImageUrl": "https://www.history.com/.image/ar_1:1%2Cc_fill%2Ccs_srgb%2Cfl_progressive%2Cq_auto:good%2Cw_1200/MTU3ODc5MDgwMjU4Nzc0MzQ1/tokugawa-ieyasu.jpg",
    "ShortStory": "Tokugawa Ieyasu, original name Matsudaira Takechiyo, also called Matsudaira Motoyasu, (born Jan. 31, 1543, Okazaki, Japan—died June 1, 1616, Sumpu), the founder of the last shogunate in Japan—the Tokugawa, or Edo, shogunate (1603–1867). Ieyasu was born into the family of a local warrior situated several miles east of modern Nagoya, one of many such families struggling to survive in a brutal age of endemic civil strife. His childhood was scarcely auspicious. His father, Matsudaira Hirotada, was involved in a network of shifting alliances that repeatedly drew him into battle. When Ieyasu was two years old, his mother was permanently separated from his father’s family because of one such change in alliances, and in 1547 military adversity compelled his father to send him away as hostage to the Imagawa family, powerful neighbours headquartered at Sumpu (now the city of Shizuoka) to the east. However, members of the rival Oda clan to the west waylaid his entourage, and he was held for two years before being released to the Imagawa. Conditions at Sumpu were more settled, and Ieyasu was trained in the military and governmental arts and developed a great love for falconry. In the late 1550s he took a wife, fathered the first of several sons, and began to acquire military experience by leading forces on behalf of Imagawa Yoshimoto, the clan leader. Despite his personal comfort, however, Ieyasu’s years at Sumpu had been worrisome ones. He had learned that his father had been murdered by a close vassal in 1549 (one of the events leading to his release by the Oda) and had observed helplessly from afar the subsequent disintegration of his family fortunes. In 1560 Imagawa Yoshimoto was slain during a battle with Oda Nobunaga, who was rapidly gaining power, and young Ieyasu seized the opportunity to return to his family’s small castle and assume control of his surviving relatives and vassals. Within months he took steps to ally himself with Nobunaga, at the same time pacifying the new and inept leader of the Imagawa house long enough to recall his wife and son from Sumpu. Freed for a few years from warring with neighbours, he directed his military efforts to crushing rebellious Buddhist sectarian groups within the Matsudaira (after 1566, Tokugawa) domain. Concurrently, he devoted much energy to improving his small army’s command structure, appointing civil administrators, and formulating and enforcing procedures of taxation, law enforcement, and litigation.During the later 1560s the Imagawa domain disintegrated, and Ieyasu expanded to the east as opportunity permitted. In 1570 this expansion led him to move his headquarters eastward to Hamamatsu, a small coastal town that he developed into the commercial and strategic centre of a thriving domain. Relying heavily on his alliance with the now-mighty Nobunaga, Ieyasu survived the vicissitudes of endemic war and slowly extended his territory until, by the early 1580s, he had become an important daimyo (feudal baron), in control of the fertile and populous area stretching from Okazaki eastward to the mountain barrier at Hakone. In 1582 Nobunaga was wounded by a rebellious subordinate and committed suicide; Toyotomi Hideyoshi, his most brilliant general, quickly avenged the death and moved to assume Nobunaga’s preeminent political position. Ieyasu, then in the prime of life, emerged as his principal rival. After a few bloody but indecisive skirmishes, however, the cautious Ieyasu offered a vow of fealty, and Hideyoshi was content to leave Ieyasu’s domain intact. During the rest of the 1580s, while Hideyoshi busily extended his control over the daimyo of southwestern Japan, Ieyasu strengthened himself as best he could. He continued to enlarge his vassal force, increase his domain’s productivity, and improve the reliability of his administration. And in 1586, for greater security, he moved his headquarters even farther to the east, away from Hideyoshi, to Sumpu, the town he had known years before as a hostage. In 1589 Hideyoshi determined to obtain vows of subordination from the Hōjō daimyo, who held a large district east of the Hakone mountain barrier. When the Hōjō refused to submit, Hideyoshi and Ieyasu mobilized a great army and navy that blockaded the Hōjō forces in their seaside castle at Odawara. After a long and patient siege the Hōjō were starved into capitulation. At Hideyoshi’s suggestion Ieyasu then surrendered his coastal provinces west of Hakone in return for the Hōjō domain to the east. As rapidly as possible he moved thousands of vassals, their military equipment, and their households to the little fort and farmlands near the fishing village of Edo (modern Tokyo), nearly a month’s march from Hideyoshi’s headquarters near Kyōto. During the 1590s Ieyasu, unlike several great daimyo from western Japan, avoided involvement in Hideyoshi’s two disastrous military expeditions to Korea. Instead, he grasped the opportunity afforded by his transfer to his new lands to deploy his forces rationally and to make his domain as secure as possible. He stationed his most powerful vassals on the perimeter of his territory and along main access routes, keeping the least powerful—and least dangerous to himself—nearer Edo. He then placed large tracts of land close by the town under direct administration by appointed officials, thereby assuring his castle inhabitants easy access to the largest possible supply of foodstuffs, and made detailed land and property surveys in order to regularize taxation. He also confiscated the weapons of all villagers, thereby reducing the likelihood of peasant rebellion, and moved vigorously to attract skilled artisans and businessmen to his new castle town. He undertook engineering projects to enlarge his castle, facilitate urban growth, and assure a water supply for the town populace. When Hideyoshi died in 1598, Ieyasu had the largest, most reliable army and the most productive and best organized domain in all Japan. Hideyoshi’s death precipitated another power struggle among the daimyo, and Ieyasu, as the most powerful and most respected of Hideyoshi’s former vassal advisers, became the head of one faction in that struggle. The armies assembled in the autumn of 1600 at Sekigahara, some 50 miles (80 km) northeast of Kyōto, and in the ensuing battle Ieyasu’s eastern army triumphed.",
    "Quotes": [
      {
        "Id": 34,
        "Text": "To know your enemy, first you must become his friend, and once you become his friend, all his defences come down. Then you can choose the most fitting method for his demise",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 35,
        "Text": "Look upon the wrath of thy enemy. If thou only knowest what it is to conquer, and knowest not what it is to be defeated; woe unto thee, it will fare ill with thee",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 36,
        "Text": "Persuade thyself that imperfection and inconvenience are the lot of natural mortals, and there will be no room for discontent, neither for despair.",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 37,
        "Text": "Forbearance is the root of quietness and assurance forever.",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 38,
        "Text": "If my descendants wish to be as I am, they must study patience.",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 39,
        "Text": "Little bird, if you don't sing I will wait for you to sing.",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      },
      {
        "Id": 40,
        "Text": "If the lack of freedom is considered normal, there will be no complaints.",
        "SamuraiId": "933e0300-7422-4696-a0c5-d0a458a527d0"
      }
    ]
  }
]